let bodyParser = require('body-parser');
var express = require('express');
let server = express();
let cors = require('cors');
server.use(bodyParser.urlencoded({ extended: false }));
server.use(bodyParser.json());
server.use(cors());
/*
 * Get API to return avaliable rooms
 */
server.get('/api/rooms', (req, res) => {
    var result = roomsRecords;
    res.setHeader('Content-Type', 'application/json');
    res.send(result);
});
/*
* roomsRecords json to display in the angular app
*/
roomsRecords = [{
    "id": 781,
    "numberOfBeds": "אחד",
    "desc": "החדר כולל מטבחון מאובזר (מקרר, מיקרוגל, קומקום חשמלי, פלטה חשמלית לבישול, טוסטר וכלי מטבח תהנו מארוחת בוקר קלה הכוללת שתיה חמה מכל הסוגים, חלב, ריבות ביתיות, חמאה, לבנה, לחמניות וצנימים.  כמו כן, תמצאו בחדר, מגבות ומצעים, מזגן, טלוויזיה בכבלים וגישה חופשית לאינטרנט אלחוטי בכל המתחם. בנוסף, אנו שמים דגש רב על אחזקה וניקיון החדרים.",
    "img": "room3.jpg"
},
{
    "id": 782,
    "numberOfBeds": "שתים",
    "desc": "החדר כולל מטבחון מאובזר (מקרר, מיקרוגל, קומקום חשמלי, פלטה חשמלית לבישול, טוסטר וכלי מטבח תהנו מארוחת בוקר קלה הכוללת שתיה חמה מכל הסוגים, חלב, ריבות ביתיות, חמאה, לבנה, לחמניות וצנימים.  כמו כן, תמצאו בחדר, מגבות ומצעים, מזגן, טלוויזיה בכבלים וגישה חופשית לאינטרנט אלחוטי בכל המתחם. בנוסף, אנו שמים דגש רב על אחזקה וניקיון החדרים.",
    "img": "room2.jpg"
},
{
    "id": 783,
    "numberOfBeds": "שלוש",
    "desc": "החדר כולל מטבחון מאובזר (מקרר, מיקרוגל, קומקום חשמלי, פלטה חשמלית לבישול, טוסטר וכלי מטבח תהנו מארוחת בוקר קלה הכוללת שתיה חמה מכל הסוגים, חלב, ריבות ביתיות, חמאה, לבנה, לחמניות וצנימים.  כמו כן, תמצאו בחדר, מגבות ומצעים, מזגן, טלוויזיה בכבלים וגישה חופשית לאינטרנט אלחוטי בכל המתחם. בנוסף, אנו שמים דגש רב על אחזקה וניקיון החדרים.",
    "img": "room4.jpg"
},
{
    "id": 784,
    "numberOfBeds": "ארבע",
    "desc": "החדר כולל מטבחון מאובזר (מקרר, מיקרוגל, קומקום חשמלי, פלטה חשמלית לבישול, טוסטר וכלי מטבח תהנו מארוחת בוקר קלה הכוללת שתיה חמה מכל הסוגים, חלב, ריבות ביתיות, חמאה, לבנה, לחמניות וצנימים.  כמו כן, תמצאו בחדר, מגבות ומצעים, מזגן, טלוויזיה בכבלים וגישה חופשית לאינטרנט אלחוטי בכל המתחם. בנוסף, אנו שמים דגש רב על אחזקה וניקיון החדרים.",
    "img": "room5.jpg"
},
{
    "id": 785,
    "numberOfBeds": "חמש",
    "desc": "החדר כולל מטבחון מאובזר (מקרר, מיקרוגל, קומקום חשמלי, פלטה חשמלית לבישול, טוסטר וכלי מטבח תהנו מארוחת בוקר קלה הכוללת שתיה חמה מכל הסוגים, חלב, ריבות ביתיות, חמאה, לבנה, לחמניות וצנימים.  כמו כן, תמצאו בחדר, מגבות ומצעים, מזגן, טלוויזיה בכבלים וגישה חופשית לאינטרנט אלחוטי בכל המתחם. בנוסף, אנו שמים דגש רב על אחזקה וניקיון החדרים.",
    "img": "room6.jpg"
},
{
    "id": 786,
    "numberOfBeds": "אחד",
    "desc": "החדר כולל מטבחון מאובזר (מקרר, מיקרוגל, קומקום חשמלי, פלטה חשמלית לבישול, טוסטר וכלי מטבח תהנו מארוחת בוקר קלה הכוללת שתיה חמה מכל הסוגים, חלב, ריבות ביתיות, חמאה, לבנה, לחמניות וצנימים.  כמו כן, תמצאו בחדר, מגבות ומצעים, מזגן, טלוויזיה בכבלים וגישה חופשית לאינטרנט אלחוטי בכל המתחם. בנוסף, אנו שמים דגש רב על אחזקה וניקיון החדרים.",
    "img": "room7.jpg"
},
{
    "id": 787,
    "numberOfBeds": "שתים",
    "desc": "החדר כולל מטבחון מאובזר (מקרר, מיקרוגל, קומקום חשמלי, פלטה חשמלית לבישול, טוסטר וכלי מטבח תהנו מארוחת בוקר קלה הכוללת שתיה חמה מכל הסוגים, חלב, ריבות ביתיות, חמאה, לבנה, לחמניות וצנימים.  כמו כן, תמצאו בחדר, מגבות ומצעים, מזגן, טלוויזיה בכבלים וגישה חופשית לאינטרנט אלחוטי בכל המתחם. בנוסף, אנו שמים דגש רב על אחזקה וניקיון החדרים.",
    "img": "room8.jpg"
},
{
    "id": 788,
    "numberOfBeds": "שלוש",
    "desc": "החדר כולל מטבחון מאובזר (מקרר, מיקרוגל, קומקום חשמלי, פלטה חשמלית לבישול, טוסטר וכלי מטבח תהנו מארוחת בוקר קלה הכוללת שתיה חמה מכל הסוגים, חלב, ריבות ביתיות, חמאה, לבנה, לחמניות וצנימים.  כמו כן, תמצאו בחדר, מגבות ומצעים, מזגן, טלוויזיה בכבלים וגישה חופשית לאינטרנט אלחוטי בכל המתחם. בנוסף, אנו שמים דגש רב על אחזקה וניקיון החדרים.",
    "img": "room9.jpg"
},
{
    "id": 789,
    "numberOfBeds": "ארבע",
    "desc": "החדר כולל מטבחון מאובזר (מקרר, מיקרוגל, קומקום חשמלי, פלטה חשמלית לבישול, טוסטר וכלי מטבח תהנו מארוחת בוקר קלה הכוללת שתיה חמה מכל הסוגים, חלב, ריבות ביתיות, חמאה, לבנה, לחמניות וצנימים.  כמו כן, תמצאו בחדר, מגבות ומצעים, מזגן, טלוויזיה בכבלים וגישה חופשית לאינטרנט אלחוטי בכל המתחם. בנוסף, אנו שמים דגש רב על אחזקה וניקיון החדרים.",
    "img": "room10.jpg"
},
{
    "id": 790,
    "numberOfBeds": "חמש",
    "desc": "החדר כולל מטבחון מאובזר (מקרר, מיקרוגל, קומקום חשמלי, פלטה חשמלית לבישול, טוסטר וכלי מטבח תהנו מארוחת בוקר קלה הכוללת שתיה חמה מכל הסוגים, חלב, ריבות ביתיות, חמאה, לבנה, לחמניות וצנימים.  כמו כן, תמצאו בחדר, מגבות ומצעים, מזגן, טלוויזיה בכבלים וגישה חופשית לאינטרנט אלחוטי בכל המתחם. בנוסף, אנו שמים דגש רב על אחזקה וניקיון החדרים.",
    "img": "room11.jpg"
}
];
server.listen(3002, () => {
});